[Survived] BlockStatement
trayio/mock-inspect/src/MockedRequest.ts:31:7
         private requestResponseInfo: RequestResponseInfo,
         private contract: Contract,
         private stacktrace: string
-    ) {
-        this.requestResponseInfo = requestResponseInfo
-        this.contract = contract
-        this.stacktrace = stacktrace
-    }
+    ) {}
 
     // PUBLIC METHODS **********************************************************

[Killed] BlockStatement
trayio/mock-inspect/src/MockedRequest.ts:38:42
     }
 
     // PUBLIC METHODS **********************************************************
-    public expectRequestToHaveBeenMade() {
-        this.expectNetworkRequestToHaveBeenMadeFactory(true)
-    }
+    public expectRequestToHaveBeenMade() {}
 
     public expectRequestToNotHaveBeenMade() {

[Killed] BooleanLiteral
trayio/mock-inspect/src/MockedRequest.ts:39:56
 
     // PUBLIC METHODS **********************************************************
     public expectRequestToHaveBeenMade() {
-        this.expectNetworkRequestToHaveBeenMadeFactory(true)
+        this.expectNetworkRequestToHaveBeenMadeFactory(false)
     }
 

[Killed] BlockStatement
trayio/mock-inspect/src/MockedRequest.ts:42:45
         this.expectNetworkRequestToHaveBeenMadeFactory(true)
     }
 
-    public expectRequestToNotHaveBeenMade() {
-        this.expectNetworkRequestToHaveBeenMadeFactory(false)
-    }
+    public expectRequestToNotHaveBeenMade() {}
 
     public expectRequestMadeMatchingContract(passedInContract?: Contract) {

[Killed] BooleanLiteral
trayio/mock-inspect/src/MockedRequest.ts:43:56
     }
 
     public expectRequestToNotHaveBeenMade() {
-        this.expectNetworkRequestToHaveBeenMadeFactory(false)
+        this.expectNetworkRequestToHaveBeenMadeFactory(true)
     }
 

[Killed] ConditionalExpression
trayio/mock-inspect/src/MockedRequest.ts:72:13
             contractUrlPieces.pathname,
             this.stacktrace
         )
-        if (this.isGraphQLRequest()) {
+        if (false) {
             this.compareGraphQlQueries(
                 requestPayload,

[Killed] ConditionalExpression
trayio/mock-inspect/src/MockedRequest.ts:72:13
             contractUrlPieces.pathname,
             this.stacktrace
         )
-        if (this.isGraphQLRequest()) {
+        if (true) {
             this.compareGraphQlQueries(
                 requestPayload,

[Killed] BlockStatement
trayio/mock-inspect/src/MockedRequest.ts:78:16
                 contract,
                 this.stacktrace
             )
-        } else {
-            this.compareRestRequests(requestPayload, requestMade, contract)
-        }
+        } else {}
     }
 

[Killed] BlockStatement
trayio/mock-inspect/src/MockedRequest.ts:86:40
     public expectRequestMadeMatching({
         requestPayload,
         requestHeaders,
-    }: ExpectRequestMadeMatchingInput) {
-        this.expectRequestToHaveBeenMade()
-        const requestMade = this.requestResponseInfo
-        if (requestPayload) {
-            compareRequestBodies(
-                requestMade.body,
-                requestPayload,
-                this.stacktrace
-            )
-        }
-        if (requestHeaders) {
-            checkRequestContainedDesiredHeaders(
-                requestMade.headers,
-                requestHeaders,
-                this.stacktrace
-            )
-        }
-    }
+    }: ExpectRequestMadeMatchingInput) {}
 
     // PRIVATE METHODS *********************************************************

[Killed] BlockStatement
trayio/mock-inspect/src/MockedRequest.ts:89:29
     }: ExpectRequestMadeMatchingInput) {
         this.expectRequestToHaveBeenMade()
         const requestMade = this.requestResponseInfo
-        if (requestPayload) {
-            compareRequestBodies(
-                requestMade.body,
-                requestPayload,
-                this.stacktrace
-            )
-        }
+        if (requestPayload) {}
         if (requestHeaders) {
             checkRequestContainedDesiredHeaders(

[Killed] ConditionalExpression
trayio/mock-inspect/src/MockedRequest.ts:89:13
     }: ExpectRequestMadeMatchingInput) {
         this.expectRequestToHaveBeenMade()
         const requestMade = this.requestResponseInfo
-        if (requestPayload) {
+        if (false) {
             compareRequestBodies(
                 requestMade.body,

[Killed] ConditionalExpression
trayio/mock-inspect/src/MockedRequest.ts:96:13
                 this.stacktrace
             )
         }
-        if (requestHeaders) {
+        if (false) {
             checkRequestContainedDesiredHeaders(
                 requestMade.headers,

[Killed] BlockStatement
trayio/mock-inspect/src/MockedRequest.ts:96:29
                 this.stacktrace
             )
         }
-        if (requestHeaders) {
-            checkRequestContainedDesiredHeaders(
-                requestMade.headers,
-                requestHeaders,
-                this.stacktrace
-            )
-        }
+        if (requestHeaders) {}
     }
 

[Killed] BlockStatement
trayio/mock-inspect/src/MockedRequest.ts:108:7
     // PRIVATE METHODS *********************************************************
     private expectNetworkRequestToHaveBeenMadeFactory(
         expectedToBeMade: boolean
-    ) {
-        const hasRequestBeenDone = this.requestResponseInfo.called
-        compareRequestMadeStatusAgainstExpectation(
-            hasRequestBeenDone,
-            expectedToBeMade,
-            this.stacktrace
-        )
-    }
+    ) {}
 
     private compareGraphQlQueries(

[Killed] BlockStatement
trayio/mock-inspect/src/MockedRequest.ts:121:7
         requestPayload: NetworkRequestBody,
         contract: Contract,
         stacktrace: string
-    ) {
-        const queryMade = convertGraphQlRequestBodyToJson(requestPayload)
-        const queryExpected = convertGraphQlRequestBodyToJson(
-            contract.request.payload
-        )
-        try {
-            jestExpect(queryMade).toEqual(queryExpected)
-        } catch (error) {
-            throwErrorWithExtraMessageAndFixedStracktrace(
-                "It looks like the query that has been made doesn't match the expectations from the contract.",
-                error,
-                stacktrace
-            )
-        }
-    }
+    ) {}
 
     private compareRestRequests(

[Killed] BlockStatement
trayio/mock-inspect/src/MockedRequest.ts:126:13
         const queryExpected = convertGraphQlRequestBodyToJson(
             contract.request.payload
         )
-        try {
-            jestExpect(queryMade).toEqual(queryExpected)
-        } catch (error) {
+        try {} catch (error) {
             throwErrorWithExtraMessageAndFixedStracktrace(
                 "It looks like the query that has been made doesn't match the expectations from the contract.",

[Killed] BlockStatement
trayio/mock-inspect/src/MockedRequest.ts:128:25
         )
         try {
             jestExpect(queryMade).toEqual(queryExpected)
-        } catch (error) {
-            throwErrorWithExtraMessageAndFixedStracktrace(
-                "It looks like the query that has been made doesn't match the expectations from the contract.",
-                error,
-                stacktrace
-            )
-        }
+        } catch (error) {}
     }
 

[Killed] StringLiteral
trayio/mock-inspect/src/MockedRequest.ts:130:17
             jestExpect(queryMade).toEqual(queryExpected)
         } catch (error) {
             throwErrorWithExtraMessageAndFixedStracktrace(
-                "It looks like the query that has been made doesn't match the expectations from the contract.",
+                "",
                 error,
                 stacktrace

[Killed] BlockStatement
trayio/mock-inspect/src/MockedRequest.ts:141:7
         requestPayload: NetworkRequestBody,
         requestMade: RequestResponseInfo,
         contract: Contract
-    ) {
-        compareRequestBodies(
-            requestPayload,
-            contract.request.payload,
-            this.stacktrace
-        )
-        const contractUrlPieces = new URL(contract.request.url)
-        const requestMadeUrlPieces = new URL(requestMade.url)
-        compareQueryParameters(
-            requestMadeUrlPieces.search,
-            contractUrlPieces.search,
-            this.stacktrace
-        )
-    }
+    ) {}
 
     private getContractForMockedRequest(

[Killed] LogicalOperator
trayio/mock-inspect/src/MockedRequest.ts:160:13
         stacktrace: string,
         passedInContract?: Contract
     ): Contract {
-        if (passedInContract && this.contract) {
+        if (passedInContract || this.contract) {
             throwErrorWithFixedStacktrace(

[Killed] ConditionalExpression
trayio/mock-inspect/src/MockedRequest.ts:160:13
         stacktrace: string,
         passedInContract?: Contract
     ): Contract {
-        if (passedInContract && this.contract) {
+        if (true) {
             throwErrorWithFixedStacktrace(

[Killed] ConditionalExpression
trayio/mock-inspect/src/MockedRequest.ts:166:13
                 stacktrace
             )
         }
-        if (!passedInContract && !this.contract) {
+        if (false) {
             throwErrorWithFixedStacktrace(

[Killed] BooleanLiteral
trayio/mock-inspect/src/MockedRequest.ts:166:13
                 stacktrace
             )
         }
-        if (!passedInContract && !this.contract) {
+        if (passedInContract && !this.contract) {
             throwErrorWithFixedStacktrace(

[Killed] LogicalOperator
trayio/mock-inspect/src/MockedRequest.ts:172:16
                 stacktrace
             )
         }
-        return passedInContract || this.contract
+        return passedInContract && this.contract
     }
 
