[Killed] BooleanLiteral
trayio/mock-inspect/src/mockRequest.ts:60:17
             protocol: "",
         },
         url: "",
-        called: false,
+        called: true,
         response,
         graphQLUsed: false,

[Survived] BooleanLiteral
trayio/mock-inspect/src/mockRequest.ts:62:22
         url: "",
         called: false,
         response,
-        graphQLUsed: false,
+        graphQLUsed: true,
         body: undefined,
         headers: undefined,

[Survived] LogicalOperator
trayio/mock-inspect/src/mockRequest.ts:69:12
 }
 
 const getStatusCode = (mockOpts: MockResponseOptions): number => {
-    return mockOpts.responseStatus || 200
+    return mockOpts.responseStatus && 200
 }
 

[Killed] LogicalOperator
trayio/mock-inspect/src/mockRequest.ts:73:12
 }
 
 const getMethod = (mockOpts: MockResponseOptions): HttpMethod => {
-    return mockOpts.requestMethod || "GET"
+    return mockOpts.requestMethod && "GET"
 }
 

[Killed] ConditionalExpression
trayio/mock-inspect/src/mockRequest.ts:80:9
     mockOpts: MockResponseOptions
 ): NetworkResponseBody => {
     let body
-    if (mockOpts.responseBody) {
+    if (false) {
         body = isObject(mockOpts.responseBody)
             ? JSON.stringify(mockOpts.responseBody)

[Killed] BlockStatement
trayio/mock-inspect/src/mockRequest.ts:80:32
     mockOpts: MockResponseOptions
 ): NetworkResponseBody => {
     let body
-    if (mockOpts.responseBody) {
-        body = isObject(mockOpts.responseBody)
-            ? JSON.stringify(mockOpts.responseBody)
-            : mockOpts.responseBody
-    }
+    if (mockOpts.responseBody) {}
     return body
 }

[Killed] BooleanLiteral
trayio/mock-inspect/src/mockRequest.ts:89:21
 }
 
 const isGraphQLMock = (mockOpts: MockResponseOptions): boolean => {
-    let isGraphQL = false
+    let isGraphQL = true
     if (mockOpts.graphQLMutationName || mockOpts.graphQLQueryName) {
         isGraphQL = true

[Killed] BlockStatement
trayio/mock-inspect/src/mockRequest.ts:90:68
 
 const isGraphQLMock = (mockOpts: MockResponseOptions): boolean => {
     let isGraphQL = false
-    if (mockOpts.graphQLMutationName || mockOpts.graphQLQueryName) {
-        isGraphQL = true
-    }
+    if (mockOpts.graphQLMutationName || mockOpts.graphQLQueryName) {}
     return isGraphQL
 }

[Killed] ConditionalExpression
trayio/mock-inspect/src/mockRequest.ts:90:9
 
 const isGraphQLMock = (mockOpts: MockResponseOptions): boolean => {
     let isGraphQL = false
-    if (mockOpts.graphQLMutationName || mockOpts.graphQLQueryName) {
+    if (true) {
         isGraphQL = true
     }

[Killed] BooleanLiteral
trayio/mock-inspect/src/mockRequest.ts:91:21
 const isGraphQLMock = (mockOpts: MockResponseOptions): boolean => {
     let isGraphQL = false
     if (mockOpts.graphQLMutationName || mockOpts.graphQLQueryName) {
-        isGraphQL = true
+        isGraphQL = false
     }
     return isGraphQL

[Killed] ConditionalExpression
trayio/mock-inspect/src/mockRequest.ts:97:9
 }
 
 const validateMockOptions = (mockOpts: MockResponseOptions): void => {
-    if (mockOpts.graphQLMutationName && mockOpts.graphQLQueryName) {
+    if (true) {
         throw new Error(
             "You passed graphQLMutationName AND graphQLQueryName into the mock options - please pick one, you can't have both."

[Killed] LogicalOperator
trayio/mock-inspect/src/mockRequest.ts:97:9
 }
 
 const validateMockOptions = (mockOpts: MockResponseOptions): void => {
-    if (mockOpts.graphQLMutationName && mockOpts.graphQLQueryName) {
+    if (mockOpts.graphQLMutationName || mockOpts.graphQLQueryName) {
         throw new Error(
             "You passed graphQLMutationName AND graphQLQueryName into the mock options - please pick one, you can't have both."

[Killed] LogicalOperator
trayio/mock-inspect/src/mockRequest.ts:103:9
         )
     }
     if (
-        !mockOpts.graphQLMutationName &&
-        !mockOpts.graphQLQueryName &&
-        !mockOpts.requestPattern
+        !mockOpts.graphQLMutationName && !mockOpts.graphQLQueryName || !mockOpts.requestPattern
     ) {
         throw new Error(

[Killed] ConditionalExpression
trayio/mock-inspect/src/mockRequest.ts:103:9
         )
     }
     if (
-        !mockOpts.graphQLMutationName &&
-        !mockOpts.graphQLQueryName &&
-        !mockOpts.requestPattern
+        false
     ) {
         throw new Error(

[Killed] BooleanLiteral
trayio/mock-inspect/src/mockRequest.ts:104:9
     }
     if (
         !mockOpts.graphQLMutationName &&
-        !mockOpts.graphQLQueryName &&
+        mockOpts.graphQLQueryName &&
         !mockOpts.requestPattern
     ) {

[Killed] BooleanLiteral
trayio/mock-inspect/src/mockRequest.ts:105:9
     if (
         !mockOpts.graphQLMutationName &&
         !mockOpts.graphQLQueryName &&
-        !mockOpts.requestPattern
+        mockOpts.requestPattern
     ) {
         throw new Error(

[Killed] ConditionalExpression
trayio/mock-inspect/src/mockRequest.ts:133:9
         headers: mockOpts.responseHeaders,
         statusCode,
     })
-    if (isGraphQL) {
+    if (true) {
         handleGraphQLRequest({
             mockOpts,

[Killed] BlockStatement
trayio/mock-inspect/src/mockRequest.ts:133:20
         headers: mockOpts.responseHeaders,
         statusCode,
     })
-    if (isGraphQL) {
-        handleGraphQLRequest({
-            mockOpts,
-            body,
-            statusCode,
-            requestResponseInfo,
-        })
-    } else {
+    if (isGraphQL) {} else {
         handleRestRequest({
             mockOpts,

[Killed] BlockStatement
trayio/mock-inspect/src/mockRequest.ts:140:12
             statusCode,
             requestResponseInfo,
         })
-    } else {
-        handleRestRequest({
-            mockOpts,
-            method,
-            body,
-            statusCode,
-            requestResponseInfo,
-        })
-    }
+    } else {}
 
     return new MockedRequest(requestResponseInfo, contract, stacktrace)
