[Killed] BlockStatement
mock-inspect/src/responseHandlers/common.ts:18:52
 import {MockResponseOptions} from "../types/MockResponseOptions"
 import {updateRequestResponseInfo} from "../utils"
 
-export const setResponseBody = (response, body) => {
-    const isResponseJson = isObject(body)
-    if (isResponseJson) {
-        response.headers.set("content-type", "application/json")
-        response.body = JSON.stringify(body)
-    } else {
-        response.body = body
-    }
-}
+export const setResponseBody = (response, body) => {}
 
 export const setResponseHeaders = (response, mockOpts: MockResponseOptions) => {

[Killed] BlockStatement
mock-inspect/src/responseHandlers/common.ts:20:25
 
 export const setResponseBody = (response, body) => {
     const isResponseJson = isObject(body)
-    if (isResponseJson) {
-        response.headers.set("content-type", "application/json")
-        response.body = JSON.stringify(body)
-    } else {
+    if (isResponseJson) {} else {
         response.body = body
     }

[Killed] ConditionalExpression
mock-inspect/src/responseHandlers/common.ts:20:9
 
 export const setResponseBody = (response, body) => {
     const isResponseJson = isObject(body)
-    if (isResponseJson) {
+    if (true) {
         response.headers.set("content-type", "application/json")
         response.body = JSON.stringify(body)

[Killed] StringLiteral
mock-inspect/src/responseHandlers/common.ts:21:30
 export const setResponseBody = (response, body) => {
     const isResponseJson = isObject(body)
     if (isResponseJson) {
-        response.headers.set("content-type", "application/json")
+        response.headers.set("", "application/json")
         response.body = JSON.stringify(body)
     } else {

[Killed] BlockStatement
mock-inspect/src/responseHandlers/common.ts:23:12
     if (isResponseJson) {
         response.headers.set("content-type", "application/json")
         response.body = JSON.stringify(body)
-    } else {
-        response.body = body
-    }
+    } else {}
 }
 

[Killed] BlockStatement
mock-inspect/src/responseHandlers/common.ts:28:80
     }
 }
 
-export const setResponseHeaders = (response, mockOpts: MockResponseOptions) => {
-    if (mockOpts.responseHeaders) {
-        Object.keys(mockOpts.responseHeaders).forEach((headerKey) => {
-            response.headers.set(headerKey, mockOpts.responseHeaders[headerKey])
-        })
-    }
-    response.headers.delete("x-powered-by")
-}
+export const setResponseHeaders = (response, mockOpts: MockResponseOptions) => {}
 
 export const getResponseType = (

[Killed] ConditionalExpression
mock-inspect/src/responseHandlers/common.ts:29:9
 }
 
 export const setResponseHeaders = (response, mockOpts: MockResponseOptions) => {
-    if (mockOpts.responseHeaders) {
+    if (true) {
         Object.keys(mockOpts.responseHeaders).forEach((headerKey) => {
             response.headers.set(headerKey, mockOpts.responseHeaders[headerKey])

[Killed] ConditionalExpression
mock-inspect/src/responseHandlers/common.ts:29:9
 }
 
 export const setResponseHeaders = (response, mockOpts: MockResponseOptions) => {
-    if (mockOpts.responseHeaders) {
+    if (false) {
         Object.keys(mockOpts.responseHeaders).forEach((headerKey) => {
             response.headers.set(headerKey, mockOpts.responseHeaders[headerKey])

[Timeout] BlockStatement
mock-inspect/src/responseHandlers/common.ts:30:70
 
 export const setResponseHeaders = (response, mockOpts: MockResponseOptions) => {
     if (mockOpts.responseHeaders) {
-        Object.keys(mockOpts.responseHeaders).forEach((headerKey) => {
-            response.headers.set(headerKey, mockOpts.responseHeaders[headerKey])
-        })
+        Object.keys(mockOpts.responseHeaders).forEach((headerKey) => {})
     }
     response.headers.delete("x-powered-by")

[Killed] ConditionalExpression
mock-inspect/src/responseHandlers/common.ts:41:12
     mswResponder: ResponseComposition,
     mockOpts: MockResponseOptions
 ) => {
-    return mockOpts.persistent === true ? mswResponder : mswResponder.once
+    return true ? mswResponder : mswResponder.once
 }
 

[Killed] EqualityOperator
mock-inspect/src/responseHandlers/common.ts:41:12
     mswResponder: ResponseComposition,
     mockOpts: MockResponseOptions
 ) => {
-    return mockOpts.persistent === true ? mswResponder : mswResponder.once
+    return mockOpts.persistent !== true ? mswResponder : mswResponder.once
 }
 

[Killed] BlockStatement
mock-inspect/src/responseHandlers/common.ts:58:7
     body: NetworkResponseBody
     statusCode: number
     mockOpts: MockResponseOptions
-}) => {
-    const responder = getResponseType(mswResponder, mockOpts)
-    return responder((response) => {
-        response.status = statusCode
-        setResponseBody(response, body)
-        setResponseHeaders(response, mockOpts)
-        updateRequestResponseInfo({
-            requestResponseInfo,
-            body: mswRequest.body,
-            headers: mswRequest.headers,
-            url: (mswRequest.url as unknown) as string,
-            called: true,
-        })
-        return response
-    })
-}
+}) => {}
 

[Timeout] BooleanLiteral
mock-inspect/src/responseHandlers/common.ts:69:21
             body: mswRequest.body,
             headers: mswRequest.headers,
             url: (mswRequest.url as unknown) as string,
-            called: true,
+            called: false,
         })
         return response
