[Killed] LogicalOperator
mock-inspect/src/responseHandlers/graphql.ts:16:9
     mockOpts: MockResponseOptions
 ) => {
     return (
-        mockOpts.graphQLAutoMocking &&
-        mockOpts.graphQLAutoMocking.schema &&
+        mockOpts.graphQLAutoMocking || mockOpts.graphQLAutoMocking.schema &&
         !mockOpts.responseBody
     )

[Killed] ConditionalExpression
mock-inspect/src/responseHandlers/graphql.ts:16:9
     mockOpts: MockResponseOptions
 ) => {
     return (
-        mockOpts.graphQLAutoMocking &&
-        mockOpts.graphQLAutoMocking.schema &&
-        !mockOpts.responseBody
+        false
     )
 }

[Killed] BooleanLiteral
mock-inspect/src/responseHandlers/graphql.ts:18:9
     return (
         mockOpts.graphQLAutoMocking &&
         mockOpts.graphQLAutoMocking.schema &&
-        !mockOpts.responseBody
+        mockOpts.responseBody
     )
 }

[Killed] ConditionalExpression
mock-inspect/src/responseHandlers/graphql.ts:27:9
     mockOpts: MockResponseOptions,
     variables?: JsonObject
 ): JsonObject | undefined => {
-    if (shouldAutoGenerateGraphQLResponse(mockOpts)) {
+    if (true) {
         return autoGenerateResponseFromGraphQLSchema({
             stringSchema: mockOpts.graphQLAutoMocking.schema,

[Killed] LogicalOperator
mock-inspect/src/responseHandlers/graphql.ts:56:9
         ? mswGraphQL.query
         : mswGraphQL.mutation
     const queryOrMutationName =
-        mockOpts.graphQLQueryName || mockOpts.graphQLMutationName
+        mockOpts.graphQLQueryName && mockOpts.graphQLMutationName
     server.use(
         // eslint-disable-next-line no-unused-vars

[Killed] BlockStatement
mock-inspect/src/responseHandlers/graphql.ts:59:66
         mockOpts.graphQLQueryName || mockOpts.graphQLMutationName
     server.use(
         // eslint-disable-next-line no-unused-vars
-        graphQLQueryType(queryOrMutationName, (req, res, ctx) => {
-            const autoGeneratedResponse = getAutoGeneratedGraphQLResponse(
-                req.body.query,
-                mockOpts,
-                req.body.variables
-            )
-            const responseBody = autoGeneratedResponse || body
-            return makeMswResponseHandler({
-                body: responseBody,
-                mockOpts,
-                mswRequest: req,
-                mswResponder: res,
-                requestResponseInfo,
-                statusCode,
-            })
-        })
+        graphQLQueryType(queryOrMutationName, (req, res, ctx) => {})
     )
 }

[Killed] LogicalOperator
mock-inspect/src/responseHandlers/graphql.ts:65:34
                 mockOpts,
                 req.body.variables
             )
-            const responseBody = autoGeneratedResponse || body
+            const responseBody = autoGeneratedResponse && body
             return makeMswResponseHandler({
                 body: responseBody,
