[Killed] BlockStatement
mock-inspect/src/responseHandlers/rest.ts:19:9
 const makeMswCompliantMockPattern = (
     mockOpts: MockResponseOptions
 ): string | RegExp => {
-    try {
-        new URL(mockOpts.requestPattern as any)
-        return mockOpts.requestPattern
-    } catch (error) {
+    try {} catch (error) {
         if (typeof mockOpts.requestPattern === "string") {
             const pathOnly = removeQueryStringsFromPathString(

[Killed] BlockStatement
mock-inspect/src/responseHandlers/rest.ts:22:21
     try {
         new URL(mockOpts.requestPattern as any)
         return mockOpts.requestPattern
-    } catch (error) {
-        if (typeof mockOpts.requestPattern === "string") {
-            const pathOnly = removeQueryStringsFromPathString(
-                mockOpts.requestPattern
-            )
-            return new RegExp(pathOnly)
-        }
-        return mockOpts.requestPattern
-    }
+    } catch (error) {}
 }
 

[Killed] BlockStatement
mock-inspect/src/responseHandlers/rest.ts:23:58
         new URL(mockOpts.requestPattern as any)
         return mockOpts.requestPattern
     } catch (error) {
-        if (typeof mockOpts.requestPattern === "string") {
-            const pathOnly = removeQueryStringsFromPathString(
-                mockOpts.requestPattern
-            )
-            return new RegExp(pathOnly)
-        }
+        if (typeof mockOpts.requestPattern === "string") {}
         return mockOpts.requestPattern
     }

[Killed] BlockStatement
mock-inspect/src/responseHandlers/rest.ts:45:7
     body: NetworkResponseBody
     statusCode: number
     requestResponseInfo: RequestResponseInfo
-}) => {
-    const restMethod = rest[method.toLowerCase()]
-    if (!restMethod) {
-        throw new Error(
-            `The HTTP method "${method}" is not supported by the underlying mocking framework we are using, sorry.`
-        )
-    }
-    const pattern = makeMswCompliantMockPattern(mockOpts)
-    server.use(
-        // eslint-disable-next-line no-unused-vars
-        restMethod(pattern, (req, res, ctx) => {
-            return makeMswResponseHandler({
-                mswResponder: res,
-                mswRequest: req,
-                body,
-                statusCode,
-                mockOpts,
-                requestResponseInfo,
-            })
-        })
-    )
-}
+}) => {}
 

[Killed] ConditionalExpression
mock-inspect/src/responseHandlers/rest.ts:47:9
     requestResponseInfo: RequestResponseInfo
 }) => {
     const restMethod = rest[method.toLowerCase()]
-    if (!restMethod) {
+    if (true) {
         throw new Error(
             `The HTTP method "${method}" is not supported by the underlying mocking framework we are using, sorry.`

[Killed] BooleanLiteral
mock-inspect/src/responseHandlers/rest.ts:47:9
     requestResponseInfo: RequestResponseInfo
 }) => {
     const restMethod = rest[method.toLowerCase()]
-    if (!restMethod) {
+    if (restMethod) {
         throw new Error(
             `The HTTP method "${method}" is not supported by the underlying mocking framework we are using, sorry.`

[Killed] BlockStatement
mock-inspect/src/responseHandlers/rest.ts:55:48
     const pattern = makeMswCompliantMockPattern(mockOpts)
     server.use(
         // eslint-disable-next-line no-unused-vars
-        restMethod(pattern, (req, res, ctx) => {
-            return makeMswResponseHandler({
-                mswResponder: res,
-                mswRequest: req,
-                body,
-                statusCode,
-                mockOpts,
-                requestResponseInfo,
-            })
-        })
+        restMethod(pattern, (req, res, ctx) => {})
     )
 }
