[Timeout] BlockStatement
trayio/mock-inspect/src/setupAndTeardown.ts:14:12
 }: {
     persistentAutoGeneratedGraphQLMocks?: GraphQLAutoMockStartupOptions[]
     allowUnmockedRequestsOnNetwork?: boolean
-} = {}) => {
-    if (persistentAutoGeneratedGraphQLMocks) {
-        const graphQLAutoGenerationHandlers = persistentAutoGeneratedGraphQLMocks.map(
-            (autoGenerationOption) => {
-                return generateMswGraphQLAutoGenerationHandler(
-                    autoGenerationOption
-                )
-            }
-        )
-        server = setupServer(...graphQLAutoGenerationHandlers)
-    } else {
-        server = setupServer()
-    }
-    if (allowUnmockedRequestsOnNetwork) {
-        server.listen()
-    } else {
-        server.listen({
-            onUnhandledRequest: "error",
-        })
-    }
-}
+} = {}) => {}
 
 export const tearDownNetworkRequestMocking = () => {

[Killed] ConditionalExpression
trayio/mock-inspect/src/setupAndTeardown.ts:15:9
     persistentAutoGeneratedGraphQLMocks?: GraphQLAutoMockStartupOptions[]
     allowUnmockedRequestsOnNetwork?: boolean
 } = {}) => {
-    if (persistentAutoGeneratedGraphQLMocks) {
+    if (false) {
         const graphQLAutoGenerationHandlers = persistentAutoGeneratedGraphQLMocks.map(
             (autoGenerationOption) => {

[Survived] ConditionalExpression
trayio/mock-inspect/src/setupAndTeardown.ts:15:9
     persistentAutoGeneratedGraphQLMocks?: GraphQLAutoMockStartupOptions[]
     allowUnmockedRequestsOnNetwork?: boolean
 } = {}) => {
-    if (persistentAutoGeneratedGraphQLMocks) {
+    if (true) {
         const graphQLAutoGenerationHandlers = persistentAutoGeneratedGraphQLMocks.map(
             (autoGenerationOption) => {

[Survived] BlockStatement
trayio/mock-inspect/src/setupAndTeardown.ts:24:12
             }
         )
         server = setupServer(...graphQLAutoGenerationHandlers)
-    } else {
-        server = setupServer()
-    }
+    } else {}
     if (allowUnmockedRequestsOnNetwork) {
         server.listen()

[Killed] ConditionalExpression
trayio/mock-inspect/src/setupAndTeardown.ts:27:9
     } else {
         server = setupServer()
     }
-    if (allowUnmockedRequestsOnNetwork) {
+    if (true) {
         server.listen()
     } else {

[Survived] BlockStatement
trayio/mock-inspect/src/setupAndTeardown.ts:27:41
     } else {
         server = setupServer()
     }
-    if (allowUnmockedRequestsOnNetwork) {
-        server.listen()
-    } else {
+    if (allowUnmockedRequestsOnNetwork) {} else {
         server.listen({
             onUnhandledRequest: "error",

[Killed] BlockStatement
trayio/mock-inspect/src/setupAndTeardown.ts:29:12
     }
     if (allowUnmockedRequestsOnNetwork) {
         server.listen()
-    } else {
-        server.listen({
-            onUnhandledRequest: "error",
-        })
-    }
+    } else {}
 }
 

[Survived] BlockStatement
trayio/mock-inspect/src/setupAndTeardown.ts:36:52
     }
 }
 
-export const tearDownNetworkRequestMocking = () => {
-    server.close()
-}
+export const tearDownNetworkRequestMocking = () => {}
 
 export const cleanUpNetworkRequestMocking = () => {

[Survived] BlockStatement
trayio/mock-inspect/src/setupAndTeardown.ts:40:51
     server.close()
 }
 
-export const cleanUpNetworkRequestMocking = () => {
-    server.restoreHandlers()
-    server.resetHandlers()
-}
+export const cleanUpNetworkRequestMocking = () => {}
 
