[Killed] ConditionalExpression
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:31:5
             [propertyName: string]: () => MockList
         }
     } = {}
-    fixedArrayLengths &&
-        Object.keys(fixedArrayLengths).forEach((typeDotProperty) => {
-            const fixedLength = fixedArrayLengths[typeDotProperty]
-            const [type, property] = typeDotProperty.split(".")
-            if (!property) {
-                throw new Error(
-                    'We have been unable to pass the settings you put into `graphQLAutoMocking.fixedArrayLengths`. The object key needs to be a string of format "type.property", i.e. "User.posts".'
-                )
-            }
-            if (!arrayLengthDirectiveObjects[type]) {
-                arrayLengthDirectiveObjects[type] = {
-                    [property]: () => new MockList(fixedLength),
-                }
-            } else {
-                arrayLengthDirectiveObjects[type] = {
-                    ...arrayLengthDirectiveObjects[type],
-                    [property]: () => new MockList(fixedLength),
-                }
-            }
-        })
+    true
     const fixedArrayLengthDirectives = {}
     Object.keys(arrayLengthDirectiveObjects).forEach((type) => {

[Killed] LogicalOperator
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:31:5
             [propertyName: string]: () => MockList
         }
     } = {}
-    fixedArrayLengths &&
-        Object.keys(fixedArrayLengths).forEach((typeDotProperty) => {
-            const fixedLength = fixedArrayLengths[typeDotProperty]
-            const [type, property] = typeDotProperty.split(".")
-            if (!property) {
-                throw new Error(
-                    'We have been unable to pass the settings you put into `graphQLAutoMocking.fixedArrayLengths`. The object key needs to be a string of format "type.property", i.e. "User.posts".'
-                )
-            }
-            if (!arrayLengthDirectiveObjects[type]) {
-                arrayLengthDirectiveObjects[type] = {
-                    [property]: () => new MockList(fixedLength),
-                }
-            } else {
-                arrayLengthDirectiveObjects[type] = {
-                    ...arrayLengthDirectiveObjects[type],
-                    [property]: () => new MockList(fixedLength),
-                }
-            }
-        })
+    fixedArrayLengths || Object.keys(fixedArrayLengths).forEach(typeDotProperty => {
+  const fixedLength = fixedArrayLengths[typeDotProperty];
+  const [type, property] = typeDotProperty.split(".");
+
+  if (!property) {
+    throw new Error('We have been unable to pass the settings you put into `graphQLAutoMocking.fixedArrayLengths`. The object key needs to be a string of format "type.property", i.e. "User.posts".');
+  }
+
+  if (!arrayLengthDirectiveObjects[type]) {
+    arrayLengthDirectiveObjects[type] = {
+      [property]: () => new MockList(fixedLength)
+    };
+  } else {
+    arrayLengthDirectiveObjects[type] = { ...arrayLengthDirectiveObjects[type],
+      [property]: () => new MockList(fixedLength)
+    };
+  }
+})
     const fixedArrayLengthDirectives = {}
     Object.keys(arrayLengthDirectiveObjects).forEach((type) => {

[Killed] BlockStatement
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:32:69
         }
     } = {}
     fixedArrayLengths &&
-        Object.keys(fixedArrayLengths).forEach((typeDotProperty) => {
-            const fixedLength = fixedArrayLengths[typeDotProperty]
-            const [type, property] = typeDotProperty.split(".")
-            if (!property) {
-                throw new Error(
-                    'We have been unable to pass the settings you put into `graphQLAutoMocking.fixedArrayLengths`. The object key needs to be a string of format "type.property", i.e. "User.posts".'
-                )
-            }
-            if (!arrayLengthDirectiveObjects[type]) {
-                arrayLengthDirectiveObjects[type] = {
-                    [property]: () => new MockList(fixedLength),
-                }
-            } else {
-                arrayLengthDirectiveObjects[type] = {
-                    ...arrayLengthDirectiveObjects[type],
-                    [property]: () => new MockList(fixedLength),
-                }
-            }
-        })
+        Object.keys(fixedArrayLengths).forEach((typeDotProperty) => {})
     const fixedArrayLengthDirectives = {}
     Object.keys(arrayLengthDirectiveObjects).forEach((type) => {

[Killed] BooleanLiteral
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:35:17
         Object.keys(fixedArrayLengths).forEach((typeDotProperty) => {
             const fixedLength = fixedArrayLengths[typeDotProperty]
             const [type, property] = typeDotProperty.split(".")
-            if (!property) {
+            if (property) {
                 throw new Error(
                     'We have been unable to pass the settings you put into `graphQLAutoMocking.fixedArrayLengths`. The object key needs to be a string of format "type.property", i.e. "User.posts".'

[Killed] BlockStatement
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:35:28
         Object.keys(fixedArrayLengths).forEach((typeDotProperty) => {
             const fixedLength = fixedArrayLengths[typeDotProperty]
             const [type, property] = typeDotProperty.split(".")
-            if (!property) {
-                throw new Error(
-                    'We have been unable to pass the settings you put into `graphQLAutoMocking.fixedArrayLengths`. The object key needs to be a string of format "type.property", i.e. "User.posts".'
-                )
-            }
+            if (!property) {}
             if (!arrayLengthDirectiveObjects[type]) {
                 arrayLengthDirectiveObjects[type] = {

[Killed] BlockStatement
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:40:53
                     'We have been unable to pass the settings you put into `graphQLAutoMocking.fixedArrayLengths`. The object key needs to be a string of format "type.property", i.e. "User.posts".'
                 )
             }
-            if (!arrayLengthDirectiveObjects[type]) {
-                arrayLengthDirectiveObjects[type] = {
-                    [property]: () => new MockList(fixedLength),
-                }
-            } else {
+            if (!arrayLengthDirectiveObjects[type]) {} else {
                 arrayLengthDirectiveObjects[type] = {
                     ...arrayLengthDirectiveObjects[type],

[Killed] ConditionalExpression
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:40:17
                     'We have been unable to pass the settings you put into `graphQLAutoMocking.fixedArrayLengths`. The object key needs to be a string of format "type.property", i.e. "User.posts".'
                 )
             }
-            if (!arrayLengthDirectiveObjects[type]) {
+            if (true) {
                 arrayLengthDirectiveObjects[type] = {
                     [property]: () => new MockList(fixedLength),

[Killed] ArrowFunction
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:42:33
             }
             if (!arrayLengthDirectiveObjects[type]) {
                 arrayLengthDirectiveObjects[type] = {
-                    [property]: () => new MockList(fixedLength),
+                    [property]: () => undefined,
                 }
             } else {

[Killed] BlockStatement
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:44:20
                 arrayLengthDirectiveObjects[type] = {
                     [property]: () => new MockList(fixedLength),
                 }
-            } else {
-                arrayLengthDirectiveObjects[type] = {
-                    ...arrayLengthDirectiveObjects[type],
-                    [property]: () => new MockList(fixedLength),
-                }
-            }
+            } else {}
         })
     const fixedArrayLengthDirectives = {}

[Killed] ArrowFunction
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:47:33
             } else {
                 arrayLengthDirectiveObjects[type] = {
                     ...arrayLengthDirectiveObjects[type],
-                    [property]: () => new MockList(fixedLength),
+                    [property]: () => undefined,
                 }
             }

[Killed] BlockStatement
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:52:64
             }
         })
     const fixedArrayLengthDirectives = {}
-    Object.keys(arrayLengthDirectiveObjects).forEach((type) => {
-        fixedArrayLengthDirectives[type] = () =>
-            arrayLengthDirectiveObjects[type]
-    })
+    Object.keys(arrayLengthDirectiveObjects).forEach((type) => {})
     return fixedArrayLengthDirectives
 }

[Timeout] ArrowFunction
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:53:44
         })
     const fixedArrayLengthDirectives = {}
     Object.keys(arrayLengthDirectiveObjects).forEach((type) => {
-        fixedArrayLengthDirectives[type] = () =>
-            arrayLengthDirectiveObjects[type]
+        fixedArrayLengthDirectives[type] = () => undefined
     })
     return fixedArrayLengthDirectives

[Killed] ArrowFunction
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:73:21
     return addMocksToSchema({
         schema: executableSchema,
         mocks: {
-            String: () => uuidReadable.generate(),
+            String: () => undefined,
             ...customTypes,
             ...fixedArrayLengthMocks,

[Killed] ConditionalExpression
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:105:9
         undefined,
         variables
     )
-    if (errors) {
+    if (true) {
         const unknownTypeErrors = []
         errors.forEach((err) => {

[Timeout] ConditionalExpression
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:105:9
         undefined,
         variables
     )
-    if (errors) {
+    if (false) {
         const unknownTypeErrors = []
         errors.forEach((err) => {

[Killed] BlockStatement
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:107:33
     )
     if (errors) {
         const unknownTypeErrors = []
-        errors.forEach((err) => {
-            const isErrorDueToMockNotDefined = /no mock defined for type/i.test(
-                err.message
-            )
-            if (isErrorDueToMockNotDefined) {
-                unknownTypeErrors.push(err)
-            }
-        })
+        errors.forEach((err) => {})
         if (unknownTypeErrors.length > 0) {

[Killed] ConditionalExpression
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:111:17
             const isErrorDueToMockNotDefined = /no mock defined for type/i.test(
                 err.message
             )
-            if (isErrorDueToMockNotDefined) {
+            if (false) {
                 unknownTypeErrors.push(err)
             }

[Killed] BlockStatement
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:111:45
             const isErrorDueToMockNotDefined = /no mock defined for type/i.test(
                 err.message
             )
-            if (isErrorDueToMockNotDefined) {
-                unknownTypeErrors.push(err)
-            }
+            if (isErrorDueToMockNotDefined) {}
         })
         if (unknownTypeErrors.length > 0) {

[Killed] EqualityOperator
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:115:13
                 unknownTypeErrors.push(err)
             }
         })
-        if (unknownTypeErrors.length > 0) {
+        if (unknownTypeErrors.length >= 0) {
             throw new Error(errMsg)

[Killed] EqualityOperator
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:115:13
                 unknownTypeErrors.push(err)
             }
         })
-        if (unknownTypeErrors.length > 0) {
+        if (unknownTypeErrors.length <= 0) {
             throw new Error(errMsg)

[Killed] ObjectLiteral
mock-inspect/src/utils/autoGenerateResponseFromGraphQLSchema.ts:121:12
         }
         return {data, errors}
     }
-    return {data, errors}
+    return {}
 }
 
