[Killed] ConditionalExpression
mock-inspect/src/utils/index.ts:44:9
 ): string => {
     const newError = error
     newError.message = `${message}\n\n${error.message}`
-    if (process.env.AVOID_CLIPPED_STACKTRACE !== "true") {
+    if (false) {
         newError.stack = stacktrace
     }

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:44:58
 ): string => {
     const newError = error
     newError.message = `${message}\n\n${error.message}`
-    if (process.env.AVOID_CLIPPED_STACKTRACE !== "true") {
-        newError.stack = stacktrace
-    }
+    if (process.env.AVOID_CLIPPED_STACKTRACE !== "true") {}
     throw newError
 }

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:53:9
 const convertPotentialJsonStringToJsonObject = (
     potentialJsonStringOrObject: string | JsonObject
 ): string | JsonObject => {
-    try {
-        if (typeof potentialJsonStringOrObject === "string") {
-            return JSON.parse(potentialJsonStringOrObject)
-        }
-        return potentialJsonStringOrObject
-    } catch (error) {
+    try {} catch (error) {
         return potentialJsonStringOrObject
     }

[Survived] BlockStatement
mock-inspect/src/utils/index.ts:54:62
     potentialJsonStringOrObject: string | JsonObject
 ): string | JsonObject => {
     try {
-        if (typeof potentialJsonStringOrObject === "string") {
-            return JSON.parse(potentialJsonStringOrObject)
-        }
+        if (typeof potentialJsonStringOrObject === "string") {}
         return potentialJsonStringOrObject
     } catch (error) {

[Survived] BlockStatement
mock-inspect/src/utils/index.ts:58:21
             return JSON.parse(potentialJsonStringOrObject)
         }
         return potentialJsonStringOrObject
-    } catch (error) {
-        return potentialJsonStringOrObject
-    }
+    } catch (error) {}
 }
 

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:68:9
     contractRequestBody: NetworkRequestBody,
     stacktrace: string
 ) => {
-    try {
-        if (contractRequestBody === undefined) {
-            jestExpect(["", undefined]).toContainEqual(usedRequestBody)
-        } else {
-            jestExpect(
-                convertPotentialJsonStringToJsonObject(usedRequestBody)
-            ).toEqual(
-                convertPotentialJsonStringToJsonObject(contractRequestBody)
-            )
-        }
-    } catch (error) {
+    try {} catch (error) {
         throwErrorWithExtraMessageAndFixedStracktrace(

[Killed] EqualityOperator
mock-inspect/src/utils/index.ts:69:13
     stacktrace: string
 ) => {
     try {
-        if (contractRequestBody === undefined) {
+        if (contractRequestBody !== undefined) {
             jestExpect(["", undefined]).toContainEqual(usedRequestBody)
         } else {

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:69:48
     stacktrace: string
 ) => {
     try {
-        if (contractRequestBody === undefined) {
-            jestExpect(["", undefined]).toContainEqual(usedRequestBody)
-        } else {
+        if (contractRequestBody === undefined) {} else {
             jestExpect(
                 convertPotentialJsonStringToJsonObject(usedRequestBody)

[Killed] ArrayDeclaration
mock-inspect/src/utils/index.ts:70:24
 ) => {
     try {
         if (contractRequestBody === undefined) {
-            jestExpect(["", undefined]).toContainEqual(usedRequestBody)
+            jestExpect([]).toContainEqual(usedRequestBody)
         } else {
             jestExpect(

[Killed] StringLiteral
mock-inspect/src/utils/index.ts:70:25
 ) => {
     try {
         if (contractRequestBody === undefined) {
-            jestExpect(["", undefined]).toContainEqual(usedRequestBody)
+            jestExpect(["Stryker was here!", undefined]).toContainEqual(usedRequestBody)
         } else {
             jestExpect(

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:71:16
     try {
         if (contractRequestBody === undefined) {
             jestExpect(["", undefined]).toContainEqual(usedRequestBody)
-        } else {
-            jestExpect(
-                convertPotentialJsonStringToJsonObject(usedRequestBody)
-            ).toEqual(
-                convertPotentialJsonStringToJsonObject(contractRequestBody)
-            )
-        }
+        } else {}
     } catch (error) {
         throwErrorWithExtraMessageAndFixedStracktrace(

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:91:53
     requestHeaders: RequestHeaders
 ): RequestHeadersNormalised => {
     const headers = {}
-    Object.keys(requestHeaders).forEach((header) => {
-        const headerName = header.toLowerCase()
-        if (Array.isArray(requestHeaders[header])) {
-            headers[headerName] = requestHeaders[header][0].toLowerCase()
-        } else {
-            headers[headerName] = (requestHeaders[
-                header
-            ] as string).toLowerCase()
-        }
-    })
+    Object.keys(requestHeaders).forEach((header) => {})
     return headers
 }

[Killed] ConditionalExpression
mock-inspect/src/utils/index.ts:93:13
     const headers = {}
     Object.keys(requestHeaders).forEach((header) => {
         const headerName = header.toLowerCase()
-        if (Array.isArray(requestHeaders[header])) {
+        if (true) {
             headers[headerName] = requestHeaders[header][0].toLowerCase()
         } else {

[Survived] ConditionalExpression
mock-inspect/src/utils/index.ts:93:13
     const headers = {}
     Object.keys(requestHeaders).forEach((header) => {
         const headerName = header.toLowerCase()
-        if (Array.isArray(requestHeaders[header])) {
+        if (false) {
             headers[headerName] = requestHeaders[header][0].toLowerCase()
         } else {

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:95:16
         const headerName = header.toLowerCase()
         if (Array.isArray(requestHeaders[header])) {
             headers[headerName] = requestHeaders[header][0].toLowerCase()
-        } else {
-            headers[headerName] = (requestHeaders[
-                header
-            ] as string).toLowerCase()
-        }
+        } else {}
     })
     return headers

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:108:6
     usedRequestHeaders: MswUsedRequestHeaders,
     desiredRequestHeaders: RequestHeaders,
     stacktrace: string
-) => {
-    const desiredHeaders = normaliseRequestHeaderObject(desiredRequestHeaders)
-    const usedHeaders = normaliseRequestHeaderObject(usedRequestHeaders.map)
-    try {
-        Object.entries(desiredHeaders).forEach((desiredHeader) => {
-            jestExpect(usedHeaders[desiredHeader[0]]).toBe(desiredHeader[1])
-        })
-    } catch (error) {
-        throwErrorWithExtraMessageAndFixedStracktrace(
-            `The network request has been made, but the headers with which the request was made don't contain all the headers that were expected.\nExpected headers: ${JSON.stringify(
-                desiredHeaders
-            )}\nActual headers: ${JSON.stringify(usedHeaders)}`,
-            error,
-            stacktrace
-        )
-    }
-}
+) => {}
 
 export const compareEndpointPaths = (

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:111:9
 ) => {
     const desiredHeaders = normaliseRequestHeaderObject(desiredRequestHeaders)
     const usedHeaders = normaliseRequestHeaderObject(usedRequestHeaders.map)
-    try {
-        Object.entries(desiredHeaders).forEach((desiredHeader) => {
-            jestExpect(usedHeaders[desiredHeader[0]]).toBe(desiredHeader[1])
-        })
-    } catch (error) {
+    try {} catch (error) {
         throwErrorWithExtraMessageAndFixedStracktrace(
             `The network request has been made, but the headers with which the request was made don't contain all the headers that were expected.\nExpected headers: ${JSON.stringify(

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:112:67
     const desiredHeaders = normaliseRequestHeaderObject(desiredRequestHeaders)
     const usedHeaders = normaliseRequestHeaderObject(usedRequestHeaders.map)
     try {
-        Object.entries(desiredHeaders).forEach((desiredHeader) => {
-            jestExpect(usedHeaders[desiredHeader[0]]).toBe(desiredHeader[1])
-        })
+        Object.entries(desiredHeaders).forEach((desiredHeader) => {})
     } catch (error) {
         throwErrorWithExtraMessageAndFixedStracktrace(

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:115:21
         Object.entries(desiredHeaders).forEach((desiredHeader) => {
             jestExpect(usedHeaders[desiredHeader[0]]).toBe(desiredHeader[1])
         })
-    } catch (error) {
-        throwErrorWithExtraMessageAndFixedStracktrace(
-            `The network request has been made, but the headers with which the request was made don't contain all the headers that were expected.\nExpected headers: ${JSON.stringify(
-                desiredHeaders
-            )}\nActual headers: ${JSON.stringify(usedHeaders)}`,
-            error,
-            stacktrace
-        )
-    }
+    } catch (error) {}
 }
 

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:130:6
     usedUriPath: string,
     contractUriPath: string,
     stacktrace: string
-) => {
-    try {
-        jestExpect(usedUriPath).toEqual(contractUriPath)
-    } catch (error) {
-        throwErrorWithExtraMessageAndFixedStracktrace(
-            `The request path does not match the contracts.\nPath requested by your code: ${usedUriPath}\nExpected path to be called: ${contractUriPath}`,
-            error,
-            stacktrace
-        )
-    }
-}
+) => {}
 
 const compareTwoSetsOfQueryParameters = (

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:131:9
     contractUriPath: string,
     stacktrace: string
 ) => {
-    try {
-        jestExpect(usedUriPath).toEqual(contractUriPath)
-    } catch (error) {
+    try {} catch (error) {
         throwErrorWithExtraMessageAndFixedStracktrace(
             `The request path does not match the contracts.\nPath requested by your code: ${usedUriPath}\nExpected path to be called: ${contractUriPath}`,

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:133:21
 ) => {
     try {
         jestExpect(usedUriPath).toEqual(contractUriPath)
-    } catch (error) {
-        throwErrorWithExtraMessageAndFixedStracktrace(
-            `The request path does not match the contracts.\nPath requested by your code: ${usedUriPath}\nExpected path to be called: ${contractUriPath}`,
-            error,
-            stacktrace
-        )
-    }
+    } catch (error) {}
 }
 

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:146:6
     usedQueryParams: string,
     contractQueryParams: string,
     stacktrace: string
-) => {
-    const usedParams = queryStringParser.parse(usedQueryParams)
-    const contractParams = queryStringParser.parse(contractQueryParams)
-    try {
-        jestExpect(usedParams).toEqual(contractParams)
-    } catch (error) {
-        throwErrorWithExtraMessageAndFixedStracktrace(
-            `The query parameters the app used do not match the query parameters expected by the contracts.`,
-            error,
-            stacktrace
-        )
-    }
-}
+) => {}
 
 const checkThatNoQueryParametersWereUsed = (

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:149:9
 ) => {
     const usedParams = queryStringParser.parse(usedQueryParams)
     const contractParams = queryStringParser.parse(contractQueryParams)
-    try {
-        jestExpect(usedParams).toEqual(contractParams)
-    } catch (error) {
+    try {} catch (error) {
         throwErrorWithExtraMessageAndFixedStracktrace(
             `The query parameters the app used do not match the query parameters expected by the contracts.`,

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:151:21
     const contractParams = queryStringParser.parse(contractQueryParams)
     try {
         jestExpect(usedParams).toEqual(contractParams)
-    } catch (error) {
-        throwErrorWithExtraMessageAndFixedStracktrace(
-            `The query parameters the app used do not match the query parameters expected by the contracts.`,
-            error,
-            stacktrace
-        )
-    }
+    } catch (error) {}
 }
 

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:163:6
 const checkThatNoQueryParametersWereUsed = (
     usedQueryParams: string,
     stacktrace: string
-) => {
-    try {
-        jestExpect(usedQueryParams).toEqual("")
-    } catch (error) {
-        throwErrorWithExtraMessageAndFixedStracktrace(
-            `The query parameters the app is using for the request should have been empty.\nApp used query parameters: ${JSON.stringify(
-                usedQueryParams
-            )}\nExpected query parameters: none`,
-            error,
-            stacktrace
-        )
-    }
-}
+) => {}
 
 export const compareQueryParameters = (

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:164:9
     usedQueryParams: string,
     stacktrace: string
 ) => {
-    try {
-        jestExpect(usedQueryParams).toEqual("")
-    } catch (error) {
+    try {} catch (error) {
         throwErrorWithExtraMessageAndFixedStracktrace(
             `The query parameters the app is using for the request should have been empty.\nApp used query parameters: ${JSON.stringify(

[Killed] StringLiteral
mock-inspect/src/utils/index.ts:165:45
     stacktrace: string
 ) => {
     try {
-        jestExpect(usedQueryParams).toEqual("")
+        jestExpect(usedQueryParams).toEqual("Stryker was here!")
     } catch (error) {
         throwErrorWithExtraMessageAndFixedStracktrace(

[Timeout] BlockStatement
mock-inspect/src/utils/index.ts:166:21
 ) => {
     try {
         jestExpect(usedQueryParams).toEqual("")
-    } catch (error) {
-        throwErrorWithExtraMessageAndFixedStracktrace(
-            `The query parameters the app is using for the request should have been empty.\nApp used query parameters: ${JSON.stringify(
-                usedQueryParams
-            )}\nExpected query parameters: none`,
-            error,
-            stacktrace
-        )
-    }
+    } catch (error) {}
 }
 

[Timeout] BlockStatement
mock-inspect/src/utils/index.ts:181:6
     usedQueryParams: string,
     contractQueryParams: string | null,
     stacktrace: string
-) => {
-    if (contractQueryParams === "") {
-        checkThatNoQueryParametersWereUsed(usedQueryParams, stacktrace)
-    } else {
-        compareTwoSetsOfQueryParameters(
-            usedQueryParams,
-            contractQueryParams,
-            stacktrace
-        )
-    }
-}
+) => {}
 
 export const objectHasKeys = (obj: JsonObject): boolean => {

[Killed] ConditionalExpression
mock-inspect/src/utils/index.ts:182:9
     contractQueryParams: string | null,
     stacktrace: string
 ) => {
-    if (contractQueryParams === "") {
+    if (true) {
         checkThatNoQueryParametersWereUsed(usedQueryParams, stacktrace)
     } else {

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:182:37
     contractQueryParams: string | null,
     stacktrace: string
 ) => {
-    if (contractQueryParams === "") {
-        checkThatNoQueryParametersWereUsed(usedQueryParams, stacktrace)
-    } else {
+    if (contractQueryParams === "") {} else {
         compareTwoSetsOfQueryParameters(
             usedQueryParams,

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:184:12
 ) => {
     if (contractQueryParams === "") {
         checkThatNoQueryParametersWereUsed(usedQueryParams, stacktrace)
-    } else {
-        compareTwoSetsOfQueryParameters(
-            usedQueryParams,
-            contractQueryParams,
-            stacktrace
-        )
-    }
+    } else {}
 }
 

[Killed] EqualityOperator
mock-inspect/src/utils/index.ts:194:29
 }
 
 export const objectHasKeys = (obj: JsonObject): boolean => {
-    return isObject(obj) && Object.keys(obj).length > 0
+    return isObject(obj) && Object.keys(obj).length <= 0
 }
 

[Killed] LogicalOperator
mock-inspect/src/utils/index.ts:194:12
 }
 
 export const objectHasKeys = (obj: JsonObject): boolean => {
-    return isObject(obj) && Object.keys(obj).length > 0
+    return isObject(obj) || Object.keys(obj).length > 0
 }
 

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:201:6
     usedHostName: string,
     expectedHostName: string,
     stacktrace: string
-) => {
-    try {
-        jestExpect(usedHostName).toEqual(expectedHostName)
-    } catch (error) {
-        throwErrorWithExtraMessageAndFixedStracktrace(
-            `The hostname used in this request doesn't match the expectations`,
-            error,
-            stacktrace
-        )
-    }
-}
+) => {}
 
 export const compareProtocols = (

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:202:9
     expectedHostName: string,
     stacktrace: string
 ) => {
-    try {
-        jestExpect(usedHostName).toEqual(expectedHostName)
-    } catch (error) {
+    try {} catch (error) {
         throwErrorWithExtraMessageAndFixedStracktrace(
             `The hostname used in this request doesn't match the expectations`,

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:204:21
 ) => {
     try {
         jestExpect(usedHostName).toEqual(expectedHostName)
-    } catch (error) {
-        throwErrorWithExtraMessageAndFixedStracktrace(
-            `The hostname used in this request doesn't match the expectations`,
-            error,
-            stacktrace
-        )
-    }
+    } catch (error) {}
 }
 

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:217:6
     usedProtocol: string,
     expectedProtocol: string,
     stacktrace: string
-) => {
-    try {
-        jestExpect(usedProtocol).toEqual(expectedProtocol)
-    } catch (error) {
-        throwErrorWithExtraMessageAndFixedStracktrace(
-            `The protocol used in this request doesn't match the expectations`,
-            error,
-            stacktrace
-        )
-    }
-}
+) => {}
 
 const constructRequestMadeStatusErrorMessage = (expectation: boolean) => {

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:218:9
     expectedProtocol: string,
     stacktrace: string
 ) => {
-    try {
-        jestExpect(usedProtocol).toEqual(expectedProtocol)
-    } catch (error) {
+    try {} catch (error) {
         throwErrorWithExtraMessageAndFixedStracktrace(
             `The protocol used in this request doesn't match the expectations`,

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:220:21
 ) => {
     try {
         jestExpect(usedProtocol).toEqual(expectedProtocol)
-    } catch (error) {
-        throwErrorWithExtraMessageAndFixedStracktrace(
-            `The protocol used in this request doesn't match the expectations`,
-            error,
-            stacktrace
-        )
-    }
+    } catch (error) {}
 }
 

[Killed] StringLiteral
mock-inspect/src/utils/index.ts:230:12
 }
 
 const constructRequestMadeStatusErrorMessage = (expectation: boolean) => {
-    return `You expected that the request has${
-        expectation === false ? " not" : ""
-    } been made, but it was${expectation === true ? " not" : ""}.`
+    return ``
 }
 

[Killed] EqualityOperator
mock-inspect/src/utils/index.ts:231:9
 
 const constructRequestMadeStatusErrorMessage = (expectation: boolean) => {
     return `You expected that the request has${
-        expectation === false ? " not" : ""
+        expectation !== false ? " not" : ""
     } been made, but it was${expectation === true ? " not" : ""}.`
 }

[Killed] ConditionalExpression
mock-inspect/src/utils/index.ts:231:9
 
 const constructRequestMadeStatusErrorMessage = (expectation: boolean) => {
     return `You expected that the request has${
-        expectation === false ? " not" : ""
+        true ? " not" : ""
     } been made, but it was${expectation === true ? " not" : ""}.`
 }

[Killed] BooleanLiteral
mock-inspect/src/utils/index.ts:232:46
 const constructRequestMadeStatusErrorMessage = (expectation: boolean) => {
     return `You expected that the request has${
         expectation === false ? " not" : ""
-    } been made, but it was${expectation === true ? " not" : ""}.`
+    } been made, but it was${expectation === false ? " not" : ""}.`
 }
 

[Killed] ConditionalExpression
mock-inspect/src/utils/index.ts:232:30
 const constructRequestMadeStatusErrorMessage = (expectation: boolean) => {
     return `You expected that the request has${
         expectation === false ? " not" : ""
-    } been made, but it was${expectation === true ? " not" : ""}.`
+    } been made, but it was${false ? " not" : ""}.`
 }
 

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:239:6
     hasRequestBeenDone: boolean,
     expectation: boolean,
     stacktrace: string
-) => {
-    try {
-        jestExpect(hasRequestBeenDone).toBe(expectation)
-    } catch (error) {
-        throwErrorWithFixedStacktrace(
-            constructRequestMadeStatusErrorMessage(expectation),
-            stacktrace
-        )
-    }
-}
+) => {}
 
 export const convertGraphQlRequestBodyToJson = (

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:240:9
     expectation: boolean,
     stacktrace: string
 ) => {
-    try {
-        jestExpect(hasRequestBeenDone).toBe(expectation)
-    } catch (error) {
+    try {} catch (error) {
         throwErrorWithFixedStacktrace(
             constructRequestMadeStatusErrorMessage(expectation),

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:242:21
 ) => {
     try {
         jestExpect(hasRequestBeenDone).toBe(expectation)
-    } catch (error) {
-        throwErrorWithFixedStacktrace(
-            constructRequestMadeStatusErrorMessage(expectation),
-            stacktrace
-        )
-    }
+    } catch (error) {}
 }
 

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:252:6
 
 export const convertGraphQlRequestBodyToJson = (
     reqBody: NetworkRequestBody
-) => {
-    const madeRequestBody =
-        typeof reqBody === "string"
-            ? JSON.parse(reqBody)
-            : (reqBody as JsonObject)
-    return objectHasKeys(madeRequestBody.variables)
-        ? graphQlQueryToJson(madeRequestBody.query, {
-              variables: madeRequestBody.variables,
-          })
-        : graphQlQueryToJson(madeRequestBody.query)
-}
+) => {}
 
 export const isGraphQL = (urlPath: string): boolean => {

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:284:7
     headers: any
     url: string
     called: boolean
-}) => {
-    requestResponseInfo.body = body
-    requestResponseInfo.headers = headers
-    requestResponseInfo.url = url
-    requestResponseInfo.called = called
-}
+}) => {}
 
 export const generateMswGraphQLAutoGenerationHandler = ({

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:304:14
             res: ResponseComposition,
             // eslint-disable-next-line no-unused-vars
             ctx: GraphQLMockedContext<unknown>
-        ) => {
-            const autoGeneratedResponse = autoGenerateResponseFromGraphQLSchema(
-                {
-                    stringSchema: graphQLSchema,
-                    query: req.body.query,
-                    variables: req.body.variables,
-                    customTypes,
-                    fixedArrayLengths,
-                }
-            )
-            return res((response) => {
-                setResponseBody(response, autoGeneratedResponse)
-                response.headers.delete("x-powered-by")
-                return response
-            })
-        }
+        ) => {}
     )
 }

[Killed] StringLiteral
mock-inspect/src/utils/index.ts:316:41
             )
             return res((response) => {
                 setResponseBody(response, autoGeneratedResponse)
-                response.headers.delete("x-powered-by")
+                response.headers.delete("")
                 return response
             })

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:326:6
 export const throwErrorWithFixedStacktrace = (
     message: string,
     stacktrace: string
-) => {
-    const err = Error(message)
-    err.stack = stacktrace
-    throw err
-}
+) => {}
 
 export const generateStacktraceWithoutMockedRequestInfo = () => {

[Killed] Regex
mock-inspect/src/utils/index.ts:335:30
 export const generateStacktraceWithoutMockedRequestInfo = () => {
     const stacktrace = new Error().stack
     const lines = stacktrace.split("\n")
-    const regexForThisFile = /(dist|src)\/utils\/index\.(js|ts):\d+:\d+/
+    const regexForThisFile = /(dist|src)\/utils\/index\.(js|ts):\D+:\d+/
     const regexForEntryPoint = /(dist|src)\/index\.(js|ts):\d+:\d+/
     const linesWithoutInternals = lines.filter((line) => {

[Killed] Regex
mock-inspect/src/utils/index.ts:335:30
 export const generateStacktraceWithoutMockedRequestInfo = () => {
     const stacktrace = new Error().stack
     const lines = stacktrace.split("\n")
-    const regexForThisFile = /(dist|src)\/utils\/index\.(js|ts):\d+:\d+/
+    const regexForThisFile = /(dist|src)\/utils\/index\.(js|ts):\d+:\D+/
     const regexForEntryPoint = /(dist|src)\/index\.(js|ts):\d+:\d+/
     const linesWithoutInternals = lines.filter((line) => {

[Killed] Regex
mock-inspect/src/utils/index.ts:336:32
     const stacktrace = new Error().stack
     const lines = stacktrace.split("\n")
     const regexForThisFile = /(dist|src)\/utils\/index\.(js|ts):\d+:\d+/
-    const regexForEntryPoint = /(dist|src)\/index\.(js|ts):\d+:\d+/
+    const regexForEntryPoint = /(dist|src)\/index\.(js|ts):\d:\d+/
     const linesWithoutInternals = lines.filter((line) => {
         return !regexForThisFile.test(line) && !regexForEntryPoint.test(line)

[Survived] Regex
mock-inspect/src/utils/index.ts:336:32
     const stacktrace = new Error().stack
     const lines = stacktrace.split("\n")
     const regexForThisFile = /(dist|src)\/utils\/index\.(js|ts):\d+:\d+/
-    const regexForEntryPoint = /(dist|src)\/index\.(js|ts):\d+:\d+/
+    const regexForEntryPoint = /(dist|src)\/index\.(js|ts):\d+:\d/
     const linesWithoutInternals = lines.filter((line) => {
         return !regexForThisFile.test(line) && !regexForEntryPoint.test(line)

[Killed] BlockStatement
mock-inspect/src/utils/index.ts:337:58
     const lines = stacktrace.split("\n")
     const regexForThisFile = /(dist|src)\/utils\/index\.(js|ts):\d+:\d+/
     const regexForEntryPoint = /(dist|src)\/index\.(js|ts):\d+:\d+/
-    const linesWithoutInternals = lines.filter((line) => {
-        return !regexForThisFile.test(line) && !regexForEntryPoint.test(line)
-    })
+    const linesWithoutInternals = lines.filter((line) => {})
     const stacktraceCleaned = linesWithoutInternals.join("\n")
     return stacktraceCleaned

[Killed] ConditionalExpression
mock-inspect/src/utils/index.ts:338:16
     const regexForThisFile = /(dist|src)\/utils\/index\.(js|ts):\d+:\d+/
     const regexForEntryPoint = /(dist|src)\/index\.(js|ts):\d+:\d+/
     const linesWithoutInternals = lines.filter((line) => {
-        return !regexForThisFile.test(line) && !regexForEntryPoint.test(line)
+        return false
     })
     const stacktraceCleaned = linesWithoutInternals.join("\n")

[Killed] LogicalOperator
mock-inspect/src/utils/index.ts:338:16
     const regexForThisFile = /(dist|src)\/utils\/index\.(js|ts):\d+:\d+/
     const regexForEntryPoint = /(dist|src)\/index\.(js|ts):\d+:\d+/
     const linesWithoutInternals = lines.filter((line) => {
-        return !regexForThisFile.test(line) && !regexForEntryPoint.test(line)
+        return !regexForThisFile.test(line) || !regexForEntryPoint.test(line)
     })
     const stacktraceCleaned = linesWithoutInternals.join("\n")

[Killed] StringLiteral
mock-inspect/src/utils/index.ts:340:58
     const linesWithoutInternals = lines.filter((line) => {
         return !regexForThisFile.test(line) && !regexForEntryPoint.test(line)
     })
-    const stacktraceCleaned = linesWithoutInternals.join("\n")
+    const stacktraceCleaned = linesWithoutInternals.join("")
     return stacktraceCleaned
 }
